<a href="https://colab.research.google.com/github/Priyansh-jsk/TestPython/blob/main/TestPython.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [11]:
import pandas as pd 
# Read data from file 'filename.csv' 
df = pd.read_csv("Insta.csv")

In [12]:
#1
df.shape

(100, 9)

In [13]:
#2
df.info

<bound method DataFrame.info of     Unnamed: 0  Unnamed: 0.1  ...  Time since posted Likes
0            0             0  ...           11 hours   139
1            1             1  ...            2 hours    23
2            2             2  ...            2 hours    25
3            3             3  ...            3 hours    49
4            4             4  ...            3 hours    30
..         ...           ...  ...                ...   ...
95          95             8  ...            3 hours    31
96          96             9  ...            3 hours    42
97          97            10  ...            3 hours    10
98          98            11  ...            3 hours   222
99          99            12  ...            3 hours   109

[100 rows x 9 columns]>

In [ ]:
#3

In [15]:
#4
# Preview and last 10 lines of the loaded dataframe 
df.head(10)

   Unnamed: 0  Unnamed: 0.1  ...  Time since posted Likes
0           0             0  ...           11 hours   139
1           1             1  ...            2 hours    23
2           2             2  ...            2 hours    25
3           3             3  ...            3 hours    49
4           4             4  ...            3 hours    30
5           5             5  ...            3 hours    18
6           6             6  ...            3 hours    35
7           7             7  ...            4 hours    86
8           8             8  ...            4 hours    22
9           9             9  ...            7 hours    18

[10 rows x 9 columns]

In [16]:
#4
df.tail(10)

    Unnamed: 0  Unnamed: 0.1  ...  Time since posted Likes
90          90             3  ...            2 hours    32
91          91             4  ...            2 hours    46
92          92             5  ...            2 hours    12
93          93             6  ...            2 hours    20
94          94             7  ...            3 hours    24
95          95             8  ...            3 hours    31
96          96             9  ...            3 hours    42
97          97            10  ...            3 hours    10
98          98            11  ...            3 hours   222
99          99            12  ...            3 hours   109

[10 rows x 9 columns]

In [39]:
#13
df[:4]

   n  n2
0  1   6
1  2   7
2  3   8
3  4   9

In [40]:
# this will replace "Boston Celtics" with "Omega Warrior" 
df.replace(to_replace =3, 
                 value ="Swarnika")

          n  n2
0         1   6
1         2   7
2  Swarnika   8
3         4   9
4         5   0

In [33]:
#14
students = [ ('jack', 34, 'Sydeny' , 'Australia') ,
             ('Riti', 30, 'Delhi' , 'India' ) ,
             ('Vikas', 31, 'Mumbai' , 'India' ) ,
             ('Neelu', 32, 'Bangalore' , 'India' ) ,
             ('John', 16, 'New York' , 'US') ,
             ('Mike', 17, 'las vegas' , 'US')  ]
#Create a DataFrame object
dfObj = pd.DataFrame(students, columns = ['Name' , 'Age', 'City' , 'Country'], index=['a', 'b', 'c' , 'd' , 'e' , 'f'])

In [34]:
dfObj

    Name  Age       City    Country
a   jack   34     Sydeny  Australia
b   Riti   30      Delhi      India
c  Vikas   31     Mumbai      India
d  Neelu   32  Bangalore      India
e   John   16   New York         US
f   Mike   17  las vegas         US

In [35]:
# Get names of indexes for which column Age has value 30
indexNames = dfObj[ dfObj['Age'] == 30 ].index
# Delete these row indexes from dataFrame
dfObj.drop(indexNames , inplace=True)

In [36]:
dfObj

    Name  Age       City    Country
a   jack   34     Sydeny  Australia
c  Vikas   31     Mumbai      India
d  Neelu   32  Bangalore      India
e   John   16   New York         US
f   Mike   17  las vegas         US

In [20]:
#15
df.sort_values(by='Time since posted')

    Unnamed: 0  Unnamed: 0.1  ...  Time since posted Likes
0            0             0  ...           11 hours   139
13          13            13  ...           11 hours    94
39          39             0  ...           14 hours   136
77          77             4  ...            2 hours    55
78          78             5  ...            2 hours    12
..         ...           ...  ...                ...   ...
10          10            10  ...            7 hours    31
9            9             9  ...            7 hours    18
54          54            15  ...            7 hours    65
11          11            11  ...            8 hours    48
12          12            12  ...            9 hours    80

[100 rows x 9 columns]

In [21]:
#16
d = {"n":[1,2,3,4,5], "n2":[6,7,8,9,0]}
df = pd.DataFrame(d)

In [22]:
df

   n  n2
0  1   6
1  2   7
2  3   8
3  4   9
4  5   0

In [23]:
df.nsmallest(3,"n2")

   n  n2
4  5   0
0  1   6
1  2   7

In [26]:
df.nlargest(4,"n")

   n  n2
4  5   0
3  4   9
2  3   8
1  2   7

In [17]:
#17 a)
df.describe()

       Unnamed: 0  Unnamed: 0.1        S.No   Followers      Likes
count  100.000000    100.000000  100.000000   100.00000  100.00000
mean    49.500000      8.940000   16.240000   961.96000   46.48000
std     29.011492      6.639064    7.384286  1014.62567   55.08698
min      0.000000      0.000000    1.000000    11.00000    8.00000
25%     24.750000      4.000000   10.750000   252.75000   19.00000
50%     49.500000      8.000000   16.500000   612.00000   29.00000
75%     74.250000     12.250000   22.250000  1197.00000   46.00000
max     99.000000     26.000000   30.000000  4496.00000  349.00000

In [18]:
#17 b)
df['Time since posted'].count()

100

In [19]:
#17 c)
df['Time since posted'].value_counts()

2 hours     57
3 hours     19
4 hours     13
7 hours      3
11 hours     2
8 hours      1
9 hours      1
24 hours     1
14 hours     1
5 hours      1
20 hours     1
Name: Time since posted, dtype: int64